
; Тестирование WatchDog таймера на микроконтроллере ATtiny88

.INCLUDE "../libs/tn88def.inc" ; загрузка предопределений для ATtiny88
; #include "../libs/macro.inc" ; подключение файла с макросами

;=================================================
; Имена регистров, а также различные константы
	.def 	Temp 					= R19 			; регистр для флага
	.def 	Flag 					= R20 			; регистр для флага

;=================================================
; Сегмент SRAM памяти
.DSEG			
;=================================================
; Сегмент EEPROM памяти
.ESEG
;=================================================
; Сегмент FLASH памяти
.CSEG
;=================================================
; Таблица прерываний
	.ORG 0x000
		RJMP	RESET
	.ORG 0x007	; WDTaddr - Watchdog Time-out
		RJMP	WDT_ISR

;=================================================
; прерывание watch dog таймера
WDT_ISR:
	RCALL	WDT_off
	LDI 	Flag, 1
RETI

;=================================================
; Переменные во флеш памяти
Program_name: .db "Test WatchDog timer on ATtiny88",0

;=================================================
; Подключение библиотек
#include "../libs/wdt.asm"
#include "../libs/delay.asm"

;=================================================
; Прерывание по сбросу, стартовая инициализация 
RESET:	

;=================================================
	; -- инициализация стека -- 
	LDI 	R16, Low(RAMEND) ; младший байт конечного адреса ОЗУ в R16 
	OUT 	SPL, R16 ; установка младшего байта указателя стека 
	LDI 	R16, High(RAMEND) ; старший байт конечного адреса ОЗУ в R16 
	OUT 	SPH, R16 ; установка старшего байта указателя стека 

;==============================================================
; Очистка ОЗУ и регистров R0-R31
	LDI		ZL, LOW(SRAM_START)		; Адрес начала ОЗУ в индекс
	LDI		ZH, HIGH(SRAM_START)
	CLR		R16					; Очищаем R16
RAM_Flush:
	ST 		Z+, R16			
	CPI		ZH, HIGH(RAMEND+1)	
	BRNE	RAM_Flush				
	CPI		ZH, HIGH(RAMEND+1)	
	BRNE	RAM_Flush			
	CPI		ZL, LOW(RAMEND+1)	
	BRNE	RAM_Flush
	LDI		ZL, (0x1F-2)			; Адрес регистра R29
	CLR		ZH
Reg_Flush:
	ST		Z, ZH
	DEC		ZL
	BRNE	Reg_Flush
	CLR		ZL
	CLR		ZH

;==============================================================
	; -- устанавливаем пин 0 порта D на выход -- 
	SBI		DDRD, PD0

	LDI 	Flag, 0 ; флаг задержки времени

	; инициализация WatchDog таймера
	RCALL	WDT_Init


;=================================================
; Основная программа (цикл)
Main: 	
	SBI 	PORTD, PD0 ; подача на пин PB1 высокого уровня 
	RCALL 	Delay_100ms
	CBI 	PORTD, PD0 ; подача на пин PB1 низкого уровня 
	LDI		R16, 1
	CPSE	Flag, R16
	RCALL 	Delay_500ms
	RCALL 	Delay_100ms
	RJMP 	Main ; возврат к метке Main, повторяем все в цикле 
;=================================================

