
#ifndef _TIM0A_ASM_
#define _TIM0A_ASM_

#include "../libs/macro.inc"    ; подключение файла 'макросов'

;=================================================
; Инициализация таймера
TimerCounter0_Init: ; таймеру требуется OCR0
	; Разрешение прерывания таймера 0 по совпадению канала А 
	LDI 	R16, (1 << OCIE0A)
	mOUT 	TIMSK, R16
	; Установка предделителя /8   ; CS02 CS01 CS00  -   1 0 1 - 1024, 1 0 0 - 256, 0 1 1 - 64, 0 1 0 - 8, 0 0 1 - 1
	LDI 	R16, (1 << CS01) ; (1 << CS00) ; (1 << CS02) | ; 
	mOUT 	TCCR0B, R16 
	; Установка числа сравнения 150 ((1200000/8)/1000=150 - 1 мсек. при Fcpu=1.2мГц) 
	; при Fcpu=9,6MHz 9 600 000/ 64 = 150 000 тиков в секунду, делим на 1000 = 150 тиков в милисекунду  - 1мс
	LDI 	R17, OCR0
	mOUT 	OCR0A, R17
 	; Обнуление счетчика таймера 1
	CLR		R16
	mOUT 	TCNT0, R16
ret
;=================================================

#endif  /* _TIM0A_ASM_ */
