
; Светодиодная мигалка на микроконтроллере ATtiny2313A

.INCLUDE "..\libs\tn2313Adef.inc" ; загрузка предопределений для ATtiny2313A 

;=================================================
; Имена регистров, а также различные константы
	.equ F_CPU 						= 8000000		; Частота МК
	
;==============================================================
	.equ Delay 						= 250 ; установка константы времени задержки 
	
;=================================================
; Сегмент SRAM памяти
.DSEG			
;=================================================
; Сегмент EEPROM памяти
.ESEG
;=================================================
; Сегмент FLASH памяти
.CSEG
;=================================================
; Таблица прерываний
	.ORG 0x0000
		RJMP	RESET
		
;=================================================
; Переменные во флеш памяти
; Program_name: .db "Test Blink on ATtiny2313A",0

;=================================================
; Прерывание по сбросу, стартовая инициализация 
RESET:	

;=================================================
	; -- инициализация стека -- 
	LDI 	R16, Low(RAMEND) ; младший байт конечного адреса ОЗУ в R16 
	OUT 	SPL, R16 ; установка младшего байта указателя стека 
	; LDI 	R16, High(RAMEND) ; старший байт конечного адреса ОЗУ в R16 
	; OUT 	SPH, R16 ; установка старшего байта указателя стека 

;==============================================================
; Очистка ОЗУ и регистров R0-R31
	LDI		ZL, LOW(SRAM_START)		; Адрес начала ОЗУ в индекс
	LDI		ZH, HIGH(SRAM_START)
	CLR		R16					; Очищаем R16
RAM_Flush:
	ST 		Z+, R16				
	CPI		ZH, HIGH(RAMEND+1)	
	BRNE	RAM_Flush			
	CPI		ZL, LOW(RAMEND+1)	
	BRNE	RAM_Flush
	LDI		ZL, (0x1F-2)			; Адрес регистра R29
	CLR		ZH
Reg_Flush:
	ST		Z, ZH
	DEC		ZL
	BRNE	Reg_Flush
	CLR		ZL
	CLR		ZH

;=================================================
	; -- устанавливаем пин 0 порта B на выход -- 
	; LDI R16, 0b00000001 ; поместим в регистр R16 число 1
	; OUT DDRB, R16 ; загрузим значение из регистра R16 в порт DDRB 
	SBI DDRB, PB0 ; DDRB |= (1 << PB0);


;=================================================
; Основная программа (цикл)
Main:
	SBI PORTB, PB0 ; подача на пин PD0 высокого уровня 
	RCALL Wait ; вызываем функцию задержки по времени 
	CBI PORTB, PB0 ; подача на пин PD0 низкого уровня 
	RCALL Wait ; вызываем функцию задержки по времени 	
	
	RJMP Main ; возврат к метке Main, повторяем все в цикле 
;=================================================


; -- подпрограмма задержки по времени -- 
; Fcpu = 8 MHz
Wait: ; Fcpu / (3 + 2) = N = 8 000 000 / 5 = 1 600 000 = 0x186a00 (1000 милисекунд)
	LDI 	R18, 0x18 ; старший байт N
	LDI 	R17, 0x6a ; средний байт N
	LDI 	R16, 0x00 ; младший байт N
Loop_Wait: 
	SUBI 	R16, 1 
	SBCI 	R17, 0
	SBCI 	R18, 0
	BRCC 	Loop_Wait
RET ; возврат из подпрограммы Wait 
