
; Тестирование WatchDog таймера на микроконтроллере ATtiny13A

.INCLUDE "../libs/tn13Adef.inc" ; загрузка предопределений для ATtiny13A
; #include "../libs/macro.inc" ; подключение файла с макросами

;=================================================
; Имена регистров, а также различные константы
	.def 	Temp 					= R19 			; регистр для флага
	.def 	Flag 					= R20 			; регистр для флага

;=================================================
; Сегмент SRAM памяти
.DSEG			
;=================================================
; Сегмент EEPROM памяти
.ESEG
;=================================================
; Сегмент FLASH памяти
.CSEG
;=================================================
; Таблица прерываний
	.ORG 0x0000
		RJMP	RESET
	.ORG 0x0008	; WDTaddr - Watchdog Time-out
		RJMP	WDT

;=================================================
; прерывание watch dog таймера
WDT:
	RCALL	WDT_off
	LDI 	Flag, 1
RETI

;=================================================
; Переменные во флеш памяти
Program_name: .db "Test WatchDog timer on ATtiny13A",0

;=================================================
; Подключение библиотек
#include "../libs/wdt.asm"
#include "../libs/delay.asm"

;=================================================
; Прерывание по сбросу, стартовая инициализация 
RESET:	

;=================================================
	; -- инициализация стека -- 
	LDI R16, Low(RAMEND) ; младший байт конечного адреса ОЗУ в R16 
	OUT SPL, R16 ; установка младшего байта указателя стека 

;==============================================================
; Очистка ОЗУ и регистров R0-R31
	LDI		ZL, LOW(SRAM_START)		; Адрес начала ОЗУ в индекс
	LDI		ZH, HIGH(SRAM_START)
	CLR		R16					; Очищаем R16
RAM_Flush:
	ST 		Z+, R16				
	CPI		ZH, HIGH(RAMEND+1)	
	BRNE	RAM_Flush			
	CPI		ZL, LOW(RAMEND+1)	
	BRNE	RAM_Flush
	LDI		ZL, (0x1F-2)			; Адрес регистра R29
	CLR		ZH
Reg_Flush:
	ST		Z, ZH
	DEC		ZL
	BRNE	Reg_Flush
	CLR		ZL
	CLR		ZH

;==============================================================
	; -- устанавливаем пин PB1 порта B на выход -- 
	SBI		DDRB, PB1

	LDI 	Flag, 0 ; флаг задержки времени

	; инициализация WatchDog таймера
	RCALL	WDT_Init


;=================================================
; Основная программа (цикл)
Start: 	
	SBI 	PORTB, PB1 ; подача на пин PB1 высокого уровня 
	RCALL 	Delay_100ms
	CBI 	PORTB, PB1 ; подача на пин PB1 низкого уровня 
	LDI		R16, 1
	CPSE	Flag, R16
	RCALL 	Delay_500ms
	RCALL 	Delay_100ms
	RJMP 	Start ; возврат к метке Start, повторяем все в цикле 
;=================================================

