
; Светодиодная мигалка на микроконтроллере ATmega328pb

;.INCLUDEPATH "E:\Libraries\AVR-master\asm\include" ; путь для подгрузки INC файлов 
.INCLUDE "..\libs\m328PBdef.inc" ; загрузка предопределений для ATmega328pb
;.INCLUDE "E:\Libraries\AVR-master\asm\include\m328PBdef.inc" ; загрузка предопределений для ATmega328pb

;=================================================
; Имена регистров, а также различные константы
	.equ 	F_CPU 					= 8000000		; Частота МК 8MHz
	
;=================================================
; Сегмент SRAM памяти
.DSEG			
;=================================================
; Сегмент EEPROM памяти
.ESEG
;=================================================
; Сегмент FLASH памяти
.CSEG
;=================================================
; Таблица прерываний
	.ORG 0x0000
		RJMP	RESET
		
;=================================================
; Переменные во флеш памяти
; Program_name: .db "Blink on ATmega328pb",0

;=================================================
; Прерывание по сбросу, стартовая инициализация 
RESET:	

;=================================================
	; -- инициализация стека -- 
	LDI R16, Low(RAMEND) ; младший байт конечного адреса ОЗУ в R16 
	OUT SPL, R16 ; установка младшего байта указателя стека 
	LDI R16, High(RAMEND) ; старший байт конечного адреса ОЗУ в R16 
	OUT SPH, R16 ; установка старшего байта указателя стека 
;==============================================================
	; Очистка ОЗУ и регистров R0-R31
	LDI		ZL, LOW(SRAM_START)		; Адрес начала ОЗУ в индекс
	LDI		ZH, HIGH(SRAM_START)
	CLR		R16					; Очищаем R16
RAM_Flush:
	ST 		Z+, R16				
	CPI		ZH, HIGH(RAMEND+1)	
	BRNE	RAM_Flush			
	CPI		ZL, LOW(RAMEND+1)	
	BRNE	RAM_Flush
	LDI		ZL, (0x1F-2)			; Адрес регистра R29
	CLR		ZH
Reg_Flush:
	ST		Z, ZH
	DEC		ZL
	BRNE	Reg_Flush
	CLR		ZL
	CLR		ZH

;==============================================================
	; -- устанавливаем пин 3 порта D на выход -- 
	; LDI 	R16, 0b00001000 ; поместим в регистр R16 число 8 (0x08) 
	; OUT 	DDRD, R16 ; загрузим значение из регистра R16 в порт DDRD 
	SBI		DDRD, PORTD3

;==============================================================
; -- основной цикл программы -- 
Start: 	
	SBI 	PORTD, PORTD3 ; подача на пин PD3 высокого уровня 
	RCALL 	Wait ; вызываем функцию задержки по времени 
	CBI 	PORTD, PORTD3 ; подача на пин PD3 низкого уровня 
	RCALL 	Wait ; вызываем функцию задержки по времени 	
	
	RJMP 	Start ; возврат к метке Start, повторяем все в цикле 

;==============================================================
; -- подпрограмма задержки по времени -- 
Wait: ; N = 800000 = 0x0c3500 (500 милисекунд) ; N = 160000 = 0x027100 (100 милисекунд)
	LDI 	R18, 0x02 ; старший байт N
	LDI 	R17, 0x71 ; средний байт N
	LDI 	R16, 0x00 ; младший байт N
Loop_Wait: 
	SUBI 	R16, 1 
	SBCI 	R17, 0
	SBCI 	R18, 0
	BRCC 	Loop_Wait
RET ; возврат из подпрограммы Wait 
